//
//  main.m
//  寻找两个正序数组的中位数
//
//  Created by lorne on 2020/8/25.
//  Copyright © 2020 lorne. All rights reserved.
//

#import <Foundation/Foundation.h>
//难度3🌟
int main(int argc, const char * argv[]) {
    @autoreleasepool {
        /*
         寻找两个正序数组的中位数：
        给定两个大小为 m 和 n 的正序（从小到大）数组 nums1 和 nums2。
        请你找出这两个正序数组的中位数，并且要求算法的时间复杂度为 O(log(m + n))。
        你可以假设 nums1 和 nums2 不会同时为空。
         示例 1:

         nums1 = [1, 3]
         nums2 = [2]

         则中位数是 2.0
         示例 2:

         nums1 = [1, 2]
         nums2 = [3, 4]

         则中位数是 (2 + 3)/2 = 2.5
         */

     
      
        
    }
    return 0;
}
